#+TITLE: Structured Query Language
#+AUTHOR: M. Surmashev @muradbei
#+PROPERTY: header-args:sql :engine postgresql :dbport 5400 :dbhost localhost :dbuser postgres :dbpassword postgres :database postgres

* What is SQL?

  ~SQL~ - Structured Query Language ([[https://en.wikipedia.org/wiki/SQL][Wiki]])

  #+name: Query sample
  #+BEGIN_SRC sql
    select 'Hello SQL';
  #+END_SRC

  #+RESULTS: Query sample
  | ?column?  |
  |-----------|
  | Hello SQL |

